leetcode/179/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>179. Largest Number - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>179. Largest Number</h1>
            
<div id="outline-container-org8836e1e" class="outline-2">
<h2 id="org8836e1e">题目</h2>
<div class="outline-text-2" id="text-org8836e1e">
<p>
<a href="https://leetcode.com/problems/largest-number/">链接</a>
</p>

<blockquote>
<p>
Given a list of non negative integers, arrange them such that they form the largest number.
</p>

<p>
For example, given [3, 30, 34, 5, 9], the largest formed number is 9534330.
</p>

<p>
Note: The result may be very large, so you need to return a string instead of an integer.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge19ae09" class="outline-2">
<h2 id="orge19ae09">思路</h2>
<div class="outline-text-2" id="text-orge19ae09">
<p>
两个数字 a,b, 假设 ab &gt;= ba (例如 9，98， 998&gt;989)
</p>

<ol class="org-ol">
<li>对于任意 c， abc &gt;= bac &amp;&amp; cab &gt;= cba</li>
<li><p>
对于任意 c,  需要证明 如果 ac&gt;=ca, bc&lt;=cb 则 acb &gt;= bca
</p>

<p>
x 为 a 的长度 , y 为 b 的长度， z 为 c 的长度
</p>

<p>
已知 \(a*10^y + b >= b*10^x + a\), \(b*10^z + c <= c * 10^y+b\), \(c > 0\) , \(x >= 1\)
</p>

\begin{equation}
\begin{split}
&    & & a*10^y*10^z + c * 10^y + b - (b*10^x*10^z + c*10^x + a) \\
& =  & & a*(10^{(y+z)} -1) + c * (10^y - 10^x) + b*(1-10^{(x+z)}) \\
& >= & & b*(10^x-1)*10^z + a - a + c * (10^y - 10^x) + b*(1-10^(x+z)) \\
& >= & & b*(10^{(x+z)}-10^z+1-10^{(x+z)}) + c * (10^y-10^x) \\
& >= & & b*(1-10^z) + c * (10^y-10^x) \\
& >= & & b - (c*10^y+b-c) + c *10^y - c * 10^x \\
& >= & & c*(1-10^x) \\
& >= & & 0
\end{split}
\end{equation}</li>
</ol>

<p>
从而问题转化为排序问题。且排序规则为 \((ab>=ba)=>(a>=b)\)
</p>
</div>
</div>

<div id="outline-container-org403a2a2" class="outline-2">
<h2 id="org403a2a2">代码</h2>
<div class="outline-text-2" id="text-org403a2a2">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer[]} nums
# @return {String}
def largest_number(nums)
  res = nums
        .sort {|b,a| a.to_s+b.to_s &lt;=&gt; b.to_s+a.to_s}
        .drop_while{|x| x==0 }
        .join
  if res == "" then "0" else res end
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-02-25</span>
        <span title="last modification date" class="post-info">2019-07-31</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
